{
    "uk": {
        "translation": {
            "header": {
                "home": "Головна",
                "projects": "Проєкти",
                "skills": "Навички",
                "about": "Про мене",
                "contact": "Контакти",
                "toggleTheme": "Змінити тему",
                "language": "Мова",
                "menu": "Меню"
            },
            "home": {
                "welcome": "Привіт! Я <selection>Владислав</selection> — Веб-розробник.",
                "welcomeDescription": "Я спеціалізуюсь на створенні <selection>адаптивних</selection> та <selection>функціональних</selection> вебсайтів, щоб допомогти бізнесу досягти <selection>успіху</selection>.",
                "projectsBtn": "Проєкти"
            },
            "projects": {
                "title": "Що я створив",
                "description": "Ось деякі з проєктів, над якими я працював, що демонструють мої навички у веб та мобільній розробці.",
                "converterFilesTool": {
                    "title": "Інструмент конвертації файлів",
                    "description": "Вебдодаток для конвертації файлів у різні формати, що підтримуються FFmpeg. Користувач може завантажити файл і вибрати бажаний формат для конвертації. Система обробляє файли на сервері та повертає готовий результат.",
                    "ariaLabel": "Інструмент конвертації файлів - Вебдодаток для конвертації файлів у різні формати, що підтримуються FFmpeg."
                },
                "detectingFoodAI": {
                    "title": "Розпізнавання їжі (ШІ)",
                    "description": "Застосунок на основі ШІ, який розпізнає продукти харчування на зображеннях. Користувачі можуть завантажувати фото, і система за допомогою машинного навчання ідентифікує та класифікує продукти, надаючи інформацію про їхню харчову цінність і рекомендації.",
                    "ariaLabel": "Розпізнавання їжі (ШІ) - Застосунок на основі ШІ, який розпізнає продукти харчування на зображеннях."
                },
                "carPlateRecognition": {
                    "title": "Розпізнавання номерних знаків (ШІ)",
                    "description": "Інструмент на базі ШІ, який розпізнає та витягує інформацію з номерних знаків автомобілів на зображеннях. Його можна використовувати для управління паркуванням, моніторингу трафіку тощо.",
                    "ariaLabel": "Розпізнавання номерних знаків (ШІ) - Інструмент на базі ШІ, який розпізнає та витягує інформацію з номерних знаків автомобілів на зображеннях."
                },
                "currencyConverter": {
                    "title": "Конвертер валют",
                    "description": "Мобільний застосунок, який дозволяє конвертувати валюти в режимі реального часу, використовуючи актуальні курси. Підтримує багато валют і має зручний інтерфейс.",
                    "ariaLabel": "Конвертер валют - Мобільний застосунок для конвертації валют у реальному часі."
                },
                "mediaCompressor": {
                    "title": "Інструмент стиснення медіа",
                    "description": "Інструмент для Windows, який стискає медіафайли — зображення та відео — щоб зменшити їх розмір без суттєвої втрати якості. Підтримує різні формати та дозволяє налаштовувати рівень стиснення.",
                    "ariaLabel": "Інструмент стиснення медіа - Інструмент для Windows, який стискає медіафайли."
                },
                "climateVisualizationPlatform": {
                    "title": "Платформа візуалізації клімату",
                    "description": "Спільний проєкт з командою з 2 осіб, де ми розробили вебсайт з картою, що відображає температурні показники з кількох вимірювальних станцій, ізолінії та градієнт температури.",
                    "ariaLabel": "Платформа візуалізації клімату - Спільний проєкт з картою, що відображає температурні показники та ізолінії."
                },
                "viewImages": "Переглянути зображення"
            },
            "skills": {
                "title": "Що я вмію",
                "description": "Ось технології та інструменти, які я використовую для створення ефективних і зручних рішень.",
                "categories": {
                    "frontend": "Фронтенд розробка",
                    "backend": "Бекенд розробка",
                    "mobile": "Мобільна розробка",
                    "other": "Інші навички"
                }
            },
            "about": {
                "title": "Хто я",
                "description": "Тут я трохи розповім про себе.",
                "details": "<paragraph>Я <bold>Владислав Ярмолюк</bold>, <bold>пристрастний веброзробник</bold> з Києва, Україна, з понад <bold>3-річним досвідом</bold> вивчення та практики сучасної веброзробки. Я зосереджуюсь на створенні <bold>адаптивних, функціональних і зручних</bold> вебсайтів, які вирішують реальні проблеми.</paragraph><break /><paragraph>Я завжди прагну досліджувати <bold>нові технології</bold> і постійно навчаюсь, щоб створювати ще кращі та більш <bold>інноваційні ІТ-рішення</bold>. Моя мета — створювати <bold>якісні цифрові продукти</bold>, які не лише відповідають, а й перевершують очікування користувачів.</paragraph>"
            },
            "contact": {
                "title": "Зв’яжіться зі мною",
                "description": "Не соромтеся звертатися для співпраці, запитів або просто дружньої розмови.",
                "ariaLabel": "З'язатися за допомогою {{name}}"
            },
            "footer": {
                "copyright": "© {{date}} Владислав Ярмолюк. Всі права захищено."
            },
            "imageModal": {
                "description": "Зображення {{currentImage}} з {{totalImages}}",
                "nextImage": "Наступне зображення",
                "prevImage": "Попереднє зображення"
            }
        }
    }
}
